/*
비회원 기능
	- 비회원은 게시판과 게시글은 볼 수 있지만, 게시글에 접근할 권한을 가지진 않는다.
	- 회원가입
        - 비회원은 회원가입할 때 아이디,비밀번호,이메일을 입력한다.
        - 입력한 이메일로 인증코드가 보내지고 인증코드가 확인되면 가입이 된다.
        - 가입일자는 해당 일자로 등록한다.

회원 기능
	- 로그인
		- 회원은 카테고리, 게시판을 선택해서 게시글을 확인할 수 있다.
		- 게시글 등록
			- 회원은 해당 게시판에 게시글을 등록할 수 있다.
				- 등록할 때 제목을 입력할 수 있다.
		- 게시글 조회
			- 회원은 해당 게시판에 등록된 게시글의 상세 내용을 확인할 수 있다.
            - 상세 내용에는 제목과 내용이 있다.
		- 게시글 수정
            - 해당 행동을 할 때 본인의 게시글이 아닌 경우 수정할 수 없다.
            - 본인의 게시글인 경우 제목과 내용을 입력하면 해당 내용으로 수정이 가능하다.
		- 게시글 삭제
			- 해당 행동을 할 때 본인의 게시글이 아닌 경우 삭제할 수 없다.
            - 본인의 게시글인 경우 게시글을 삭제할 수 있다.
		
관리자 기능
	- 그룹(게시판 카테고리) 관리
		- 카테고리 등록/수정/삭제
		
    
	- 게시판 관리
		- 카테고리 등록/수정/삭제







*/